Перем Ф;

Процедура Форма1_КлавишаВверх_КлавишаВниз()
	КлавишаАрг1 = Ф.КлавишаАрг();
	Сообщить("КлавишаАрг1.Alt = " + КлавишаАрг1.Alt);
	Сообщить("КлавишаАрг1.Ctrl = " + КлавишаАрг1.Ctrl);
	Сообщить("КлавишаАрг1.Shift = " + КлавишаАрг1.Shift);
	Сообщить("КлавишаАрг1.КодКлавиши = " + КлавишаАрг1.КодКлавиши);
	Сообщить("КлавишаАрг1.Модификаторы = " + КлавишаАрг1.Модификаторы);
	Сообщить("===========================================");
КонецПроцедуры

ПодключитьВнешнююКомпоненту("C:\Users\n.ivanchenko\Documents\APPS\OneGame\src\Классы\OneScriptForms.dll");
Ф = Новый ФормыДляОдноСкрипта();
Форма1 = Ф.Форма();
Форма1.Ширина = 600;
Форма1.Высота = 400;
Форма1.Текст = "Нажмите Alt или Ctrl или Shift";
Форма1.Отображать = Истина;
Форма1.Показать();
Форма1.Активизировать();

Форма1.КлавишаВниз = "Форма1_КлавишаВверх_КлавишаВниз()";
Форма1.КлавишаВверх = "Форма1_КлавишаВверх_КлавишаВниз()";
	
Пока Ф.Продолжать Цикл
	Выполнить(Ф.ПолучитьСобытие());
КонецЦикла;